x25H = 0
x21H = 0
x19H = 0
x21M = 0
x19M = 0
x17M = 0
xFDY210 = 0
xFDY180 = 0
xFDY150 = 0
RawNumber = 0
Online = 0
x293 = 0
x751 = 0
x296 = 0
x257 = 0
x175CA = 0
x125CA = 0
print('Καλώς ήρθατε στο πρόγραμμα απαρίθμησης υλικού. \nMade by Black Baron\n\n')
while True:
    x = input("\nΠαρακαλώ, καταχωρήστε το υλικό (πχ 21Μ), πατήστε 0 για τερματισμό κι εκτύπωση καταμέτρησης ή πατήστε ? για βοήθεια: ").lower()
    if x == '?':
        print('''
Δυνατές επιλογές:

25Η   21Η   19Η
FDY210   FDY180   FDY150
21M   19M   17M
293   257   751
296   175(CA)   125(CA)

Εισάγετε είτε στα ελληνικά είτε στα αγγλικά είτε με κεφαλαία είτε με μικρά.

Αν π.χ. θέλετε να καταχωρήσετε 25Η μπορειτε να το γράψετε "25η", "25Η" (ελληνικά), "25h" ή "25H" (αγγλικά).
Όλα αυτά γίνονται δεκτά και μετρώνται σωστά από το πρόγραμμα. Αν δεν γίνει δεκτό θα ειδοποιηθείτε με ανάλογο μήνυμα.
''')
    elif x == '25η' or x == '25h':
        x25H += 1
        RawNumber += 1
        Online += 1
        print('\nΤο 25Η καταχωρήθηκε επιτυχώς')
    elif x == '21η' or x == '21h':
        x21H += 1
        RawNumber += 1
        Online += 1
        print('\nΤο 21Η καταχωρήθηκε επιτυχώς')
    elif x == '19η' or x == '19h':
        x19H += 1
        RawNumber += 1
        Online += 1
        print('\nΤο 19Η καταχωρήθηκε επιτυχώς')
    elif x == '21μ' or x == '21m':
        x21M += 1
        RawNumber += 1
        print('\nΤο 21M καταχωρήθηκε επιτυχώς')
    elif x == '19μ' or x == '19m':
        x19M += 1
        RawNumber += 1
        print('\nΤο 19M καταχωρήθηκε επιτυχώς')
    elif x == '17μ' or x == '17m':
        x17M += 1
        RawNumber += 1
        print('\nΤο 17M καταχωρήθηκε επιτυχώς')
    elif '150' in x:
        xFDY150 += 1
        RawNumber += 1
        Online += 1
        print('\nΤο FDY150 καταχωρήθηκε επιτυχώς')
    elif '180' in x:
        xFDY180 += 1
        RawNumber += 1
        Online += 1
        print('\nΤο FDY180 καταχωρήθηκε επιτυχώς')
    elif '210' in x:
        xFDY210 += 1
        RawNumber += 1
        Online += 1
        print('\nΤο FDY210 καταχωρήθηκε επιτυχώς')
    elif x == '293':
        x293 += 1
        print('\nΤο 293 καταχωρήθηκε επιτυχώς')
    elif x == '751':
        x751 += 1
        print('\nΤο 751 καταχωρήθηκε επιτυχώς')
    elif x == '296':
        x296 += 1
        print('\nΤο 296 καταχωρήθηκε επιτυχώς')
    elif x == '257':
        x257 += 1
        print('\nΤο 257 καταχωρήθηκε επιτυχώς')
    elif '175' in x:
        x175CA += 1
        print('\nΤο 1,75 Ca++ (υψηλού ασβεστίου) καταχωρήθηκε επιτυχώς')
    elif '125' in x:
        x125CA += 1
        print('\nΤο 1,25 Ca++ (χαμηλού ασβεστίου) καταχωρήθηκε επιτυχώς')
    elif x == '0':
        print('\n Τέλος καταχωρήσεων. Γίνεται καταμέτρηση.\n')
        break
    else:
        print('\nΠαρακαλώ καταχωρήστε έγκυρη απάντηση (πατήστε ? για να δείτε επιλογές) ή 0 για έξοδο.')


print('*' * 25)
print(("{:<15}  {:<7}".format('Αντικειμενο', 'Νούμερο')))
print('*' * 25)
print(("{:<15}  {:<7}".format('25H', x25H)))
print(("{:<15}  {:<7}".format('21H', x21H)))
print(("{:<15}  {:<7}".format('19H', x19H)))
print('*' * 25)
print(("{:<15}  {:<7}".format('21M', x21M)))
print(("{:<15}  {:<7}".format('19M', x19M)))
print(("{:<15}  {:<7}".format('17M', x17M)))
print('*' * 25)
print(("{:<15}  {:<7}".format('FDY210', xFDY210)))
print(("{:<15}  {:<7}".format('FDY180', xFDY180)))
print(("{:<15}  {:<7}".format('FDY150', xFDY150)))
print('*' * 25)
print(("{:<15}  {:<7}".format('Γραμμές', RawNumber)))
print(("{:<15}  {:<7}".format('Φύσιγγες', RawNumber)))
print(("{:<15}  {:<7}".format('Γραμμές Online', Online)))
print('*' * 25)
print(("{:<15}  {:<7}".format('293', x293)))
print(("{:<15}  {:<7}".format('751', x751)))
print(("{:<15}  {:<7}".format('296', x296)))
print(("{:<15}  {:<7}".format('257', x257)))
print(("{:<15}  {:<7}".format('1,75 Ca++', x175CA)))
print(("{:<15}  {:<7}".format('1,25 Ca++', x125CA)))
print('*' * 25)
while True:
    x=input('Πατήστε 0 για εξοδο.')
    if x=='0':
        break
